app/Controllers/Admin.php

    public function denied()
    {
        $idTransaksi = $this->request->getVar('idTransaksi');

        $this->transaksiModel->update($idTransaksi, ['status_pemesanan' => 'ditolak']);
        $this->konfirmasiModel->where(['id_transaksi' => $idTransaksi])->delete();
---
UPDATE `transaksi` SET `status_pemesanan` = 'ditolak'
WHERE `transaksi`.`id` IN ('18')
DELETE FROM `konfirmasi`
WHERE `id_transaksi` = '18'

    public function AllTransaksi()
    {
        $transaksi = $this->transaksiModel->findAll();
---
SELECT *
FROM `transaksi`