app/Models/produkModel.php

SELECT *
FROM `produk`
---
    public function getProduk($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();